{
  "introduction": {
    "title": "Work",
    "body": "<p class=\"no-break\">From my latest contracts to where I began my career, see where I’ve worked, the experience I’ve gained and a few of my testimonials.</p><p>Need my CV? <a href=\"\">Download it here.</a></p>",
    "background": {
      "src": "assets/images/content/work-hero.jpg",
      "alt": ""
    }
  },
  "timeline": {
    "freelancing": {
      "start-date": "Early 2014",
      "start-title": "Started Freelancing! 🎉",
      "contracting": [
        {
          "year": "2016",
          "contracts": [
            {
              "slug": "ry",
              "company": "Radley Yeldar",
              "logo": {
                "src": "assets/images/content/radley-yeldar-logo.svg",
                "alt": ""
              },
              "modules": [
                {
                  "module": "timeline-content",
                  "data": {
                    "body": "<p>I developed a series of responsive builds for large international clients. The contract was initially for one month for a single project, but I was asked on multiple occasions to extend – and ended up working on four projects in total over three months.</p><p>The builds often included complex elements such as advanced Parallax and JS heavy interfaces. Whilst following the company's internal build processes, I was also able to gain further experience with Grunt, BEM and Susy.</p>"
                  }
                },
                {
                  "module": "timeline-quote",
                  "data": {
                    "name": "Megan Willis",
                    "role": "Project Manager",
                    "profile-pic": {
                      "src": "assets/images/content/megan-willis.jpg",
                      "alt": ""
                    },
                    "body": "<p>Paul is an excellent front end developer, and I would work with him again without hesitation.</p><p>A true professional, Paul is experienced, proactive, and consistently delivers quality on time.</p><p>I worked with Paul on a showcase piece for a new, major client, and he was crucial to the success of the project.</p>"
                  }
                },
                {
                  "module": "timeline-quote",
                  "data": {
                    "name": "Chris Stanley",
                    "role": "Digital and Technical Operations Manager",
                    "profile-pic": {
                      "src": "assets/images/content/chris-stanley.jpg",
                      "alt": ""
                    },
                    "body": "<p>Paul is a very competent developer, we initially secured his services for a few weeks but after seeing his work ethic, quality of work and his team work we extended many times. The whole team loved working with Paul and I had many great comments about him, the main project that Paul worked on was loved by the client and we have used it as an example of standout communications.</p><p>I personally didn't want to lose Paul and once we have more work that our internal team can't service I will be calling on Paul and hope he is free, which is doubtful given his abilities.</p><p>Outside of his work he is a good guy to have a non work chat with and is very personable.</p>"
                  }
                }
              ]
            },
            {
              "slug": "zone",
              "company": "Zone",
              "logo": {
                "src": "assets/images/content/zone-logo.svg",
                "alt": ""
              },
              "logo-title": true,
              "modules": [
                {
                  "module": "timeline-content",
                  "data": {
                      "body": "<p>I worked on several large corporate websites and a webapp adding additional responsive templates and functionality.</p><p>With these projects I gained exposure to ASP templates, Gitflow, ES6 and further experience building on top of large codebases with multiple team members. This involved writing modular SASS with the BEM methodology. Progressive enhancement was also very important within this role.</p><p>I was initially contracted for one month then was extended for another month.</p>"
                  }
                }
              ]
            },
            {
              "slug": "digirati",
              "company": "Digirati",
              "logo": {
                "src": "assets/images/content/digirati-logo.svg",
                "alt": ""
              },
              "modules" : [
                {
                  "module": "timeline-content",
                  "data": {
                    "body": "<p>Worked on an internal project for Digirati, building a series of mobile-first static templates and a style guide powered by Handlebars & Assemble. </p><p>With this contract I gained exposure to Atomic Design and worked on a commercial project without jQuery with minimal use of other JS libraries.</p><p>Accessibility and progressive enhancement were really important in this contract, with the use of ARIA within HTML and following of web accessibility guidelines.</p>"
                  }
                }
              ]
            }
          ]
        }
      ],
      "remote": {
        "period": "2014-2015",
        "title": "Freelancing remotely with various digital agencies",
        "modules": [
          {
            "module": "timeline-content",
            "no-border": true,
            "data": {
              "body": "<p>In 2014 & 2015 I worked remote for various small creative agencies and startups. This mostly involved building, from start to finish, medium sized responsive websites powered by WordPress. For these, I would create custom themes from scratch with bespoke HTML/CSS/JS. Working as an external team member, it was crucial that the builds were as close to pixel-perfect as possible to the designs supplied.</p>"
            }
          },
          {
            "module": "timeline-company-grid",
            "data": {
              "companies": [
                {
                  "slug": "studioaura",
                  "name": "StudioAura",
                  "logo": {
                    "src": "assets/images/content/studio-aura-logo.svg",
                    "alt": ""
                  },
                  "url": "http://www.studioaura.com/"
                },
                {
                  "slug": "rubber-cheese",
                  "name": "Rubber Cheese",
                  "logo": {
                    "src": "assets/images/content/rubber-cheese-logo.jpg",
                    "alt": ""
                  },
                  "url": "http://www.rubbercheese.com/"
                },
                {
                  "slug": "spork",
                  "name": "Spork Digital",
                  "logo": {
                    "src": "assets/images/content/spork-logo.svg",
                    "alt": ""
                  },
                  "url": "http://spork.digital"
                },
                {
                  "slug": "borne",
                  "name": "borne™",
                  "logo": {
                    "src": "assets/images/content/borne-logo.svg",
                    "alt": ""
                  },
                  "url": "https://www.weareborne.com/"
                }
              ]
            }
          },
          {
            "module": "timeline-quote",
            "data": {
              "name": "Kelly Molson",
              "role": "Founder & Managing Director",
              "company": "Rubber Cheese",
              "profile-pic": {
                "src": "assets/images/content/kelly-molson.jpg",
                "alt": ""
              },
              "body": "<p>Paul is extremely hard working and has produced great results for us on a number of development projects. He works efficiently and quickly, and communication (which is key for us) has always been clear and concise.</p><p>He’s easy to get on with and a really good guy. His understanding of the platforms he works on is exceptional.</p>"
            }
          }
        ]
      }
    },
    "perm": [
      {
        "period": "May 2012 - Apr 2014",
        "company": "Shout! Creative",
        "logo": {
          "src": "assets/images/content/shout-creative-logo.svg",
          "alt": ""
        },
        "role": "Lead front-end developer",
        "introduction": "<p>Converted designs into content-managed, WordPress-powered websites for a small Norwich design agency.</p>",
        "responsibilities": [
          {
            "body": "Developed website specifications with input into website structure, functionality and UX"
          },
          {
            "body": "Had input into project management, including timelines and workflow"
          },
          {
            "body": "Converted desktop designs into responsive websites in browser"
          },
          {
            "body": "Evolved desktop designs in browser when required"
          },
          {
            "body": "Liaised with freelancers working on outsourced projects"
          }
        ]
      },
      {
        "period": "Nov 2008 – Feb 2012",
        "company": "Solid State Group",
        "logo": {
          "src": "assets/images/content/solid-state-group-logo.png",
          "alt": ""
        },
        "role": "Front-end developer",
        "introduction": "<p>Worked on websites & webapps in medium-sized teams. Clients varied from high-profile internationals to startups.</p>",
        "responsibilities": [
          {
            "body": "Carried out CMS integration with the company’s enterprise level Java-based system, Cookie Jar"
          },
          {
            "body": "Fully designed websites and web applications"
          },
          {
            "body": "Trained clients in the use of their content-managed websites"
          },
          {
            "body": "After promotion from Junior Developer, led the front-end on several projects"
          },
          {
            "body": "Helped mentor junior developers, including code reviews"
          }
        ]
      }
    ]
  }
}
